nxp-mcuxpresso/sbl/target/lpc55s69/device/LPC55S69/drivers/fsl_sdif.c
    /* save IRQ handler */
    s_sdifIsr = SDIF_TransferHandleIRQ;

    /* enable the global interrupt */
    SDIF_EnableGlobalInterrupt(base, true);

    (void)EnableIRQ(s_sdifIRQ[SDIF_GetInstance(base)]);
}

/*!
 * brief SDIF return the controller capability
 * param base SDIF peripheral base address.
 * param sdif capability pointer
 */
void SDIF_GetCapability(SDIF_Type *base, sdif_capability_t *capability)
{
    assert(NULL != capability);

    /* Initializes the configure structure to zero. */
    (void)memset(capability, 0, sizeof(*capability));

    capability->sdVersion      = SDIF_SUPPORT_SD_VERSION;
    capability->mmcVersion     = SDIF_SUPPORT_MMC_VERSION;
    capability->maxBlockLength = SDIF_BLKSIZ_BLOCK_SIZE_MASK;
    /* set the max block count = max byte count / max block size */
    capability->maxBlockCount = SDIF_BYTCNT_BYTE_COUNT_MASK / SDIF_BLKSIZ_BLOCK_SIZE_MASK;
    capability->flags         = (uint32_t)kSDIF_SupportHighSpeedFlag | (uint32_t)kSDIF_SupportDmaFlag |
                        (uint32_t)kSDIF_SupportSuspendResumeFlag | (uint32_t)kSDIF_SupportV330Flag |
                        (uint32_t)kSDIF_Support4BitFlag | (uint32_t)kSDIF_Support8BitFlag;
}

static void SDIF_TransferHandleCommand(SDIF_Type *base, sdif_handle_t *handle, uint32_t interruptFlags)
{
    assert(handle->command != NULL);

    /* cmd buffer full, in this condition user need re-send the command */
    if (IS_SDIF_FLAG_SET(interruptFlags, kSDIF_HardwareLockError))
    {
        if (handle->callback.CommandReload != NULL)
        {
            handle->callback.CommandReload(base, handle->userData);
        }
    }
    /* transfer command done */
    else
    {
        if (IS_SDIF_FLAG_SET(interruptFlags, kSDIF_CommandDone))
        {
            /* transfer error */
            if ((IS_SDIF_FLAG_SET(interruptFlags, ((uint32_t)kSDIF_ResponseError | (uint32_t)kSDIF_ResponseCRCError |
                                                   (uint32_t)kSDIF_ResponseTimeout))) ||
                (SDIF_ReadCommandResponse(base, handle->command) != kStatus_Success))
            {
                if (handle->callback.TransferComplete != NULL)
                {
                    handle->callback.TransferComplete(base, handle, kStatus_SDIF_SendCmdFail, handle->userData);
                }
            }
            else
            {
                if (handle->callback.TransferComplete != NULL)
                {
                    handle->callback.TransferComplete(base, handle, kStatus_SDIF_SendCmdSuccess, handle->userData);
                }
            }
        }
    }

    SDIF_DisableInterrupt(base, kSDIF_CommandTransferStatus);
    handle->command = NULL;
}

static void SDIF_TransferHandleData(SDIF_Type *base, sdif_handle_t *handle, uint32_t interruptFlags)
{
    assert(handle->data != NULL);

    status_t transferStatus   = kStatus_SDIF_BusyTransferring;
    uint32_t transferredWords = handle->transferredWords;

    /* data starvation by host time out, software should read/write FIFO*/
    if (IS_SDIF_FLAG_SET(interruptFlags, kSDIF_DataStarvationByHostTimeout))
    {
        if (handle->data->rxData != NULL)
        {
            handle->transferredWords = SDIF_ReadDataPort(base, handle->data, transferredWords);
        }
        else if (handle->data->txData != NULL)
        {
            handle->transferredWords = SDIF_WriteDataPort(base, handle->data, transferredWords);
        }
        else
        {
            transferStatus = kStatus_SDIF_DataTransferFail;
        }
    }
    /* data transfer fail */
    else if (IS_SDIF_FLAG_SET(interruptFlags, kSDIF_DataTransferError))
    {
        if (!handle->data->enableIgnoreError)
        {
            transferStatus = kStatus_SDIF_DataTransferFail;
        }
        else
        {
            transferStatus = kStatus_SDIF_DataTransferSuccess;
        }
    }
    /* need fill data to FIFO */
    else if (IS_SDIF_FLAG_SET(interruptFlags, kSDIF_WriteFIFORequest))
    {
        handle->transferredWords = SDIF_WriteDataPort(base, handle->data, transferredWords);
    }
    /* need read data from FIFO */
    else if (IS_SDIF_FLAG_SET(interruptFlags, kSDIF_ReadFIFORequest))
    {
        handle->transferredWords = SDIF_ReadDataPort(base, handle->data, transferredWords);
    }
    else
    {
        /* Intentional empty */
    }

    /* data transfer over */
    if (IS_SDIF_FLAG_SET(interruptFlags, kSDIF_DataTransferOver))
    {
        while ((handle->data->rxData != NULL) && ((base->STATUS & SDIF_STATUS_FIFO_COUNT_MASK) != 0UL))
        {
            handle->transferredWords = SDIF_ReadDataPort(base, handle->data, transferredWords);
        }
        transferStatus = kStatus_SDIF_DataTransferSuccess;
    }

    if ((handle->callback.TransferComplete != NULL) && (transferStatus != kStatus_SDIF_BusyTransferring))
    {
        handle->callback.TransferComplete(base, handle, transferStatus, handle->userData);
        handle->data = NULL;
    }
}

static void SDIF_TransferHandleDMA(SDIF_Type *base, sdif_handle_t *handle, uint32_t interruptFlags)
{
    status_t transferStatus = kStatus_SDIF_DataTransferFail;

    if (IS_SDIF_FLAG_SET(interruptFlags, kSDIF_DMAFatalBusError))
    {
        transferStatus = kStatus_SDIF_DMATransferFailWithFBE;
    }
    else if (IS_SDIF_FLAG_SET(interruptFlags, kSDIF_DMADescriptorUnavailable))
    {
        if (handle->callback.DMADesUnavailable != NULL)
        {
            handle->callback.DMADesUnavailable(base, handle->userData);
        }
    }
    else if (IS_SDIF_FLAG_SET(interruptFlags,
                              ((uint32_t)kSDIF_AbnormalInterruptSummary | (uint32_t)kSDIF_DMACardErrorSummary)) &&
             (!handle->data->enableIgnoreError))
    {
        transferStatus = kStatus_SDIF_DataTransferFail;
    }
    /* card normal summary */
    else
    {
        transferStatus = kStatus_SDIF_DataTransferSuccess;
    }

    if (handle->callback.TransferComplete != NULL)
    {
        handle->callback.TransferComplete(base, handle, transferStatus, handle->userData);
        handle->data = NULL;
    }

    SDIF_DisableDmaInterrupt(base, kSDIF_DMAAllStatus);
}

static void SDIF_TransferHandleSDIOInterrupt(SDIF_Type *base, sdif_handle_t *handle)
{
    if (handle->callback.SDIOInterrupt != NULL)
    {
        handle->callback.SDIOInterrupt(base, handle->userData);
    }
}

static void SDIF_TransferHandleCardDetect(SDIF_Type *base, sdif_handle_t *handle)
{
    if (SDIF_DetectCardInsert(base, false) == 1UL)
    {
        if ((handle->callback.cardInserted) != NULL)
        {
            handle->callback.cardInserted(base, handle->userData);
        }
    }
    else
    {
        if ((handle->callback.cardRemoved) != NULL)
        {
            handle->callback.cardRemoved(base, handle->userData);
        }
    }
}

